           03 MODELOUP.
             06 prediction                    COMP-2 SYNC.
             06 probability OCCURS 2          COMP-2 SYNC.
             06 RES_ID                        PIC X(36).
             06 SCORE-RC                   PIC 9(4) COMP VALUE 0.
             06 SCORE-ERR-ID                  PIC X(8).
             06 SCORE-ERR-MSG                 PIC X(255).
             06 SCORE-ERR-MSG-LEN             PIC S9999 COMP-5 SYNC.
 
