           03 MODELOUP.
             06 prediction                    PIC S9(18) COMP-5 SYNC.
             06 probability OCCURS 2          COMP-2 SYNC.
